In [1]:
%load_ext sql
%sql postgresql://admin:admin@db:5432/company

Connecting to 'postgresql://admin:***@db:5432/company'

In [3]:
%%sql
CREATE TABLE IF NOT EXISTS student (
    id SERIAL primary key,
    name VARCHAR(50) NOT NULL,
    email VARCHAR(100) NOT NULL UNIQUE,
    age INT,
    city VARCHAR(50)
);

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [4]:
%%sql
SELECT * FROM student;

Running query in 'postgresql://admin:***@db:5432/company'

+----+------+-------+-----+------+
| id | name | email | age | city |
+----+------+-------+-----+------+
+----+------+-------+-----+------+

In [5]:
%%sql
INSERT INTO student (name, email, age, city)
VALUES ('Rajesh', 'rajesh@gmail.com', 25, 'Mumbai'), 
    ('Priya', 'priya@yahoo.com', 30, 'Delhi'),
    ('Gaurav', 'gourav@hotmail.com', 28, 'Jamshedpur'),
    ('Saurav', 'sourav@gmail.com', 31, 'Gujrat'),
    ('Ankit', 'ankit@gmail.com', 55, 'Banglore'),
    ('Simar', 'prabsimar@gmail.com', 18, 'Jamshedpur');

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

++
||
++
++

In [8]:
%%sql
select * from student;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+--------+---------------------+-----+------------+
| id |  name  |        email        | age |    city    |
+----+--------+---------------------+-----+------------+
| 1  | Rajesh |   rajesh@gmail.com  |  25 |   Mumbai   |
| 2  | Priya  |   priya@yahoo.com   |  30 |   Delhi    |
| 3  | Gaurav |  gourav@hotmail.com |  28 | Jamshedpur |
| 4  | Saurav |   sourav@gmail.com  |  31 |   Gujrat   |
| 5  | Ankit  |   ankit@gmail.com   |  55 |  Banglore  |
| 6  | Simar  | prabsimar@gmail.com |  18 | Jamshedpur |
+----+--------+---------------------+-----+------------+

In [12]:
%%sql
select id, name from student limit 4;

Running query in 'postgresql://admin:***@db:5432/company'

4 rows affected.

+----+--------+
| id |  name  |
+----+--------+
| 1  | Rajesh |
| 2  | Priya  |
| 3  | Gaurav |
| 4  | Saurav |
+----+--------+

In [13]:
%%sql
UPDATE student
SET age=26
WHERE name='Ankit';

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

In [14]:
%%sql
select * from student;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+--------+---------------------+-----+------------+
| id |  name  |        email        | age |    city    |
+----+--------+---------------------+-----+------------+
| 1  | Rajesh |   rajesh@gmail.com  |  25 |   Mumbai   |
| 2  | Priya  |   priya@yahoo.com   |  30 |   Delhi    |
| 3  | Gaurav |  gourav@hotmail.com |  28 | Jamshedpur |
| 4  | Saurav |   sourav@gmail.com  |  31 |   Gujrat   |
| 6  | Simar  | prabsimar@gmail.com |  18 | Jamshedpur |
| 5  | Ankit  |   ankit@gmail.com   |  26 |  Banglore  |
+----+--------+---------------------+-----+------------+

This update command will change the position of affected row

In [15]:
%%sql
select * from student order by id asc;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+--------+---------------------+-----+------------+
| id |  name  |        email        | age |    city    |
+----+--------+---------------------+-----+------------+
| 1  | Rajesh |   rajesh@gmail.com  |  25 |   Mumbai   |
| 2  | Priya  |   priya@yahoo.com   |  30 |   Delhi    |
| 3  | Gaurav |  gourav@hotmail.com |  28 | Jamshedpur |
| 4  | Saurav |   sourav@gmail.com  |  31 |   Gujrat   |
| 5  | Ankit  |   ankit@gmail.com   |  26 |  Banglore  |
| 6  | Simar  | prabsimar@gmail.com |  18 | Jamshedpur |
+----+--------+---------------------+-----+------------+

In [16]:
%%sql
UPDATE student
SET city='Channai'
WHERE age > 30;

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

In [17]:
%%sql
select * FROM student;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+--------+---------------------+-----+------------+
| id |  name  |        email        | age |    city    |
+----+--------+---------------------+-----+------------+
| 1  | Rajesh |   rajesh@gmail.com  |  25 |   Mumbai   |
| 2  | Priya  |   priya@yahoo.com   |  30 |   Delhi    |
| 3  | Gaurav |  gourav@hotmail.com |  28 | Jamshedpur |
| 6  | Simar  | prabsimar@gmail.com |  18 | Jamshedpur |
| 5  | Ankit  |   ankit@gmail.com   |  26 |  Banglore  |
| 4  | Saurav |   sourav@gmail.com  |  31 |  Channai   |
+----+--------+---------------------+-----+------------+

In [20]:
%%sql
UPDATE student
SET age=25, city='Kolkata'
WHERE name='Gaurav';

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

In [21]:
%%sql
select * from student;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+--------+---------------------+-----+------------+
| id |  name  |        email        | age |    city    |
+----+--------+---------------------+-----+------------+
| 1  | Rajesh |   rajesh@gmail.com  |  25 |   Mumbai   |
| 2  | Priya  |   priya@yahoo.com   |  30 |   Delhi    |
| 6  | Simar  | prabsimar@gmail.com |  18 | Jamshedpur |
| 5  | Ankit  |   ankit@gmail.com   |  26 |  Banglore  |
| 4  | Saurav |   sourav@gmail.com  |  31 |  Channai   |
| 3  | Gaurav |  gourav@hotmail.com |  25 |  Kolkata   |
+----+--------+---------------------+-----+------------+

In [22]:
%%sql
UPDATE student
SET age=age+1
WHERE email LIKE '%@gmail.com'

Running query in 'postgresql://admin:***@db:5432/company'

4 rows affected.

++
||
++
++

In [23]:
%%sql
select * from student;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+--------+---------------------+-----+------------+
| id |  name  |        email        | age |    city    |
+----+--------+---------------------+-----+------------+
| 2  | Priya  |   priya@yahoo.com   |  30 |   Delhi    |
| 3  | Gaurav |  gourav@hotmail.com |  25 |  Kolkata   |
| 1  | Rajesh |   rajesh@gmail.com  |  26 |   Mumbai   |
| 6  | Simar  | prabsimar@gmail.com |  19 | Jamshedpur |
| 5  | Ankit  |   ankit@gmail.com   |  27 |  Banglore  |
| 4  | Saurav |   sourav@gmail.com  |  32 |  Channai   |
+----+--------+---------------------+-----+------------+